In [76]:
import pandas as pd

pd.set_option('display.max_columns', None)

In [77]:
jobs24_df = pd.read_excel(r"C:\Users\farho\OneDrive\CUNY_MSDS\DATA608\PROJECT4\oesm24st\state_M2024_dl.xlsx")
jobs23_df = pd.read_excel(r"C:\Users\farho\OneDrive\CUNY_MSDS\DATA608\PROJECT4\oesm23st\state_M2023_dl.xlsx")
jobs22_df = pd.read_excel(r"C:\Users\farho\OneDrive\CUNY_MSDS\DATA608\PROJECT4\oesm22st\state_M2022_dl.xlsx")
jobs21_df = pd.read_excel(r"C:\Users\farho\OneDrive\CUNY_MSDS\DATA608\PROJECT4\oesm21st\state_M2021_dl.xlsx")
jobs20_df = pd.read_excel(r"C:\Users\farho\OneDrive\CUNY_MSDS\DATA608\PROJECT4\oesm20st\state_M2020_dl.xlsx")

In [78]:
jobs24_df.info()
jobs24_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37609 entries, 0 to 37608
Data columns (total 32 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   AREA          37609 non-null  int64
 1   AREA_TITLE    37609 non-null  object
 2   AREA_TYPE     37609 non-null  int64
 3   PRIM_STATE    37609 non-null  object
 4   NAICS         37609 non-null  int64
 5   NAICS_TITLE   37609 non-null  object
 6   I_GROUP       37609 non-null  object
 7   OWN_CODE      37609 non-null  int64
 8   OCC_CODE      37609 non-null  object
 9   OCC_TITLE     37609 non-null  object
 10  O_GROUP       37609 non-null  object
 11  TOT_EMP       37609 non-null  object
 12  EMP_PRSE      37609 non-null  object
 13  JOBS_1000     37609 non-null  object
 14  LOC_QUOTIENT  37609 non-null  object
 15  PCT_TOTAL     0 non-null      float64
 16  PCT_RPT       0 non-null      float64
 17  H_MEAN        37609 non-null  object
 18  A_MEAN        37609 non-null  object
 19  MEAN_PRSE     37609 non-null  object
 20  H_PCT10       37609 non-null  object
 21  H_PCT25       37609 non-null  object
 22  H_MEDIAN      37609 non-null  object
 23  H_PCT75       37609 non-null  object
 24  H_PCT90       37609 non-null  object
 25  A_PCT10       37609 non-null  object
 26  A_PCT25       37609 non-null  object
 27  A_MEDIAN      37609 non-null  object
 28  A_PCT75       37609 non-null  object
 29  A_PCT90       37609 non-null  object
 30  ANNUAL        2666 non-null   object
 31  HOURLY        162 non-null    object
dtypes: float64(2), int64(4), object(26)
memory usage: 9.2+ MB

,AREA,AREA_TITLE,AREA_TYPE,PRIM_STATE,NAICS,NAICS_TITLE,I_GROUP,OWN_CODE,OCC_CODE,OCC_TITLE,O_GROUP,TOT_EMP,EMP_PRSE,JOBS_1000,LOC_QUOTIENT,PCT_TOTAL,PCT_RPT,H_MEAN,A_MEAN,MEAN_PRSE,H_PCT10,H_PCT25,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
0,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,00-0000,All Occupations,total,2091480,0,1000,1,NaN,NaN,26.61,55350,0.3,11.31,14.74,21.07,30.82,47.51,23520,30660,43830,64110,98810,NaN,NaN
1,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-0000,Management Occupations,major,110240,0.9,52.708,0.74,NaN,NaN,57.05,118670,0.7,24.57,35.03,48.39,68.5,98.03,51100,72870,100640,142480,203900,NaN,NaN
2,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1011,Chief Executives,detailed,830,17.6,0.396,0.29,NaN,NaN,99.61,207190,4.6,50.46,62.96,79.04,106.69,#,104950,130950,164400,221910,#,NaN,NaN
3,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1021,General and Operations Managers,detailed,32370,1.6,15.476,0.67,NaN,NaN,64.8,134790,1.6,24.24,35.92,51.12,78.26,#,50410,74720,106330,162780,#,NaN,NaN
4,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1031,Legislators,detailed,1120,8.7,0.533,3.1,NaN,NaN,*,36570,3.8,*,*,*,*,*,18270,20950,26990,41760,63900,True,NaN

In [79]:
jobs23_df.info()
jobs23_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37676 entries, 0 to 37675
Data columns (total 32 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   AREA          37676 non-null  int64
 1   AREA_TITLE    37676 non-null  object
 2   AREA_TYPE     37676 non-null  int64
 3   PRIM_STATE    37676 non-null  object
 4   NAICS         37676 non-null  int64
 5   NAICS_TITLE   37676 non-null  object
 6   I_GROUP       37676 non-null  object
 7   OWN_CODE      37676 non-null  int64
 8   OCC_CODE      37676 non-null  object
 9   OCC_TITLE     37676 non-null  object
 10  O_GROUP       37676 non-null  object
 11  TOT_EMP       37676 non-null  object
 12  EMP_PRSE      37676 non-null  object
 13  JOBS_1000     37676 non-null  object
 14  LOC_QUOTIENT  37676 non-null  object
 15  PCT_TOTAL     0 non-null      float64
 16  PCT_RPT       0 non-null      float64
 17  H_MEAN        37676 non-null  object
 18  A_MEAN        37676 non-null  object
 19  MEAN_PRSE     37676 non-null  object
 20  H_PCT10       37676 non-null  object
 21  H_PCT25       37676 non-null  object
 22  H_MEDIAN      37676 non-null  object
 23  H_PCT75       37676 non-null  object
 24  H_PCT90       37676 non-null  object
 25  A_PCT10       37676 non-null  object
 26  A_PCT25       37676 non-null  object
 27  A_MEDIAN      37676 non-null  object
 28  A_PCT75       37676 non-null  object
 29  A_PCT90       37676 non-null  object
 30  ANNUAL        2642 non-null   object
 31  HOURLY        159 non-null    object
dtypes: float64(2), int64(4), object(26)
memory usage: 9.2+ MB

,AREA,AREA_TITLE,AREA_TYPE,PRIM_STATE,NAICS,NAICS_TITLE,I_GROUP,OWN_CODE,OCC_CODE,OCC_TITLE,O_GROUP,TOT_EMP,EMP_PRSE,JOBS_1000,LOC_QUOTIENT,PCT_TOTAL,PCT_RPT,H_MEAN,A_MEAN,MEAN_PRSE,H_PCT10,H_PCT25,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
0,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,00-0000,All Occupations,total,2053090,0,1000,1,NaN,NaN,25.67,53400,0.2,10.87,14.22,19.88,30.09,46.18,22620,29580,41350,62580,96050,NaN,NaN
1,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-0000,Management Occupations,major,105580,0.8,51.424,0.74,NaN,NaN,56.21,116920,0.5,24.38,35.18,47.95,67.22,95.44,50710,73180,99740,139810,198520,NaN,NaN
2,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1011,Chief Executives,detailed,720,6.8,0.348,0.25,NaN,NaN,106.26,221030,5.8,31.59,59.6,79.48,102.01,#,65700,123960,165320,212180,#,NaN,NaN
3,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1021,General and Operations Managers,detailed,34450,2.7,16.781,0.73,NaN,NaN,62.17,129310,1.1,23.11,34.74,49.67,78.25,112.54,48080,72260,103320,162760,234080,NaN,NaN
4,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1031,Legislators,detailed,1140,9.1,0.555,2.6,NaN,NaN,*,33690,5.1,*,*,*,*,*,18320,19670,24470,45050,55070,True,NaN

In [80]:
jobs22_df.info()
jobs22_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37569 entries, 0 to 37568
Data columns (total 32 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   AREA          37569 non-null  int64
 1   AREA_TITLE    37569 non-null  object
 2   AREA_TYPE     37569 non-null  int64
 3   PRIM_STATE    37569 non-null  object
 4   NAICS         37569 non-null  int64
 5   NAICS_TITLE   37569 non-null  object
 6   I_GROUP       37569 non-null  object
 7   OWN_CODE      37569 non-null  int64
 8   OCC_CODE      37569 non-null  object
 9   OCC_TITLE     37569 non-null  object
 10  O_GROUP       37569 non-null  object
 11  TOT_EMP       37569 non-null  object
 12  EMP_PRSE      37569 non-null  object
 13  JOBS_1000     37569 non-null  object
 14  LOC_QUOTIENT  37569 non-null  object
 15  PCT_TOTAL     0 non-null      float64
 16  PCT_RPT       0 non-null      float64
 17  H_MEAN        37569 non-null  object
 18  A_MEAN        37569 non-null  object
 19  MEAN_PRSE     37569 non-null  object
 20  H_PCT10       37569 non-null  object
 21  H_PCT25       37569 non-null  object
 22  H_MEDIAN      37569 non-null  object
 23  H_PCT75       37569 non-null  object
 24  H_PCT90       37569 non-null  object
 25  A_PCT10       37569 non-null  object
 26  A_PCT25       37569 non-null  object
 27  A_MEDIAN      37569 non-null  object
 28  A_PCT75       37569 non-null  object
 29  A_PCT90       37569 non-null  object
 30  ANNUAL        2611 non-null   object
 31  HOURLY        161 non-null    object
dtypes: float64(2), int64(4), object(26)
memory usage: 9.2+ MB

,AREA,AREA_TITLE,AREA_TYPE,PRIM_STATE,NAICS,NAICS_TITLE,I_GROUP,OWN_CODE,OCC_CODE,OCC_TITLE,O_GROUP,TOT_EMP,EMP_PRSE,JOBS_1000,LOC_QUOTIENT,PCT_TOTAL,PCT_RPT,H_MEAN,A_MEAN,MEAN_PRSE,H_PCT10,H_PCT25,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
0,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,00-0000,All Occupations,total,2004000,0,1000,1,NaN,NaN,24.34,50620,0.2,10.38,13.48,18.5,28.94,43.25,21580,28030,38470,60190,89950,NaN,NaN
1,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-0000,Management Occupations,major,104280,1,52.034,0.78,NaN,NaN,53.13,110500,0.8,22.92,31.83,46.12,63.53,86.89,47680,66210,95940,132150,180730,NaN,NaN
2,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1011,Chief Executives,detailed,710,13.4,0.355,0.26,NaN,NaN,91.67,190680,4.6,24.48,52.15,65.83,90.64,#,50920,108470,136930,188530,#,NaN,NaN
3,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1021,General and Operations Managers,detailed,36550,2.7,18.239,0.8,NaN,NaN,58,120640,1.9,21.41,31.39,47.17,71.64,105.19,44530,65280,98120,149010,218800,NaN,NaN
4,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1031,Legislators,detailed,930,8.4,0.464,1.6,NaN,NaN,*,30000,3.2,*,*,*,*,*,17080,18130,20320,35730,57060,True,NaN

In [81]:
jobs21_df.info()
jobs21_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37580 entries, 0 to 37579
Data columns (total 32 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   AREA          37580 non-null  int64
 1   AREA_TITLE    37580 non-null  object
 2   AREA_TYPE     37580 non-null  int64
 3   PRIM_STATE    37580 non-null  object
 4   NAICS         37580 non-null  int64
 5   NAICS_TITLE   37580 non-null  object
 6   I_GROUP       37580 non-null  object
 7   OWN_CODE      37580 non-null  int64
 8   OCC_CODE      37580 non-null  object
 9   OCC_TITLE     37580 non-null  object
 10  O_GROUP       37580 non-null  object
 11  TOT_EMP       37580 non-null  object
 12  EMP_PRSE      37580 non-null  object
 13  JOBS_1000     37580 non-null  object
 14  LOC_QUOTIENT  37580 non-null  object
 15  PCT_TOTAL     0 non-null      float64
 16  PCT_RPT       0 non-null      float64
 17  H_MEAN        37580 non-null  object
 18  A_MEAN        37580 non-null  object
 19  MEAN_PRSE     37580 non-null  object
 20  H_PCT10       37580 non-null  object
 21  H_PCT25       37580 non-null  object
 22  H_MEDIAN      37580 non-null  object
 23  H_PCT75       37580 non-null  object
 24  H_PCT90       37580 non-null  object
 25  A_PCT10       37580 non-null  object
 26  A_PCT25       37580 non-null  object
 27  A_MEDIAN      37580 non-null  object
 28  A_PCT75       37580 non-null  object
 29  A_PCT90       37580 non-null  object
 30  ANNUAL        2627 non-null   object
 31  HOURLY        135 non-null    object
dtypes: float64(2), int64(4), object(26)
memory usage: 9.2+ MB

,AREA,AREA_TITLE,AREA_TYPE,PRIM_STATE,NAICS,NAICS_TITLE,I_GROUP,OWN_CODE,OCC_CODE,OCC_TITLE,O_GROUP,TOT_EMP,EMP_PRSE,JOBS_1000,LOC_QUOTIENT,PCT_TOTAL,PCT_RPT,H_MEAN,A_MEAN,MEAN_PRSE,H_PCT10,H_PCT25,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
0,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,00-0000,All Occupations,total,1928110,0,1000,1,NaN,NaN,23.13,48110,0.2,8.96,11.89,17.91,28.68,39.79,18630,24720,37250,59660,82760,NaN,NaN
1,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-0000,Management Occupations,major,96070,1.3,49.827,0.79,NaN,NaN,51.06,106210,0.6,22.55,30.19,45.51,61.25,87.58,46900,62790,94650,127400,182160,NaN,NaN
2,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1011,Chief Executives,detailed,690,11.4,0.359,0.25,NaN,NaN,72.24,150260,4.8,28.46,45.36,61.14,82.09,#,59190,94360,127170,170750,#,NaN,NaN
3,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1021,General and Operations Managers,detailed,34370,2.7,17.824,0.84,NaN,NaN,54.5,113350,0.9,22.22,29.93,46.28,68.75,#,46220,62260,96270,143000,#,NaN,NaN
4,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1031,Legislators,detailed,1030,10,0.535,1.69,NaN,NaN,*,28520,4.5,*,*,*,*,*,16930,17310,17840,31300,56420,True,NaN

In [82]:
jobs20_df.info()
jobs20_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36085 entries, 0 to 36084
Data columns (total 31 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   AREA          36085 non-null  int64
 1   AREA_TITLE    36085 non-null  object
 2   AREA_TYPE     36085 non-null  int64
 3   PRIM_STATE    36085 non-null  object
 4   NAICS         36085 non-null  int64
 5   NAICS_TITLE   36085 non-null  object
 6   I_GROUP       36085 non-null  object
 7   OWN_CODE      36085 non-null  int64
 8   OCC_CODE      36085 non-null  object
 9   OCC_TITLE     36085 non-null  object
 10  O_GROUP       36085 non-null  object
 11  TOT_EMP       36085 non-null  object
 12  EMP_PRSE      36085 non-null  object
 13  JOBS_1000     36085 non-null  object
 14  LOC_QUOTIENT  36085 non-null  object
 15  PCT_TOTAL     0 non-null      float64
 16  H_MEAN        36085 non-null  object
 17  A_MEAN        36085 non-null  object
 18  MEAN_PRSE     36085 non-null  object
 19  H_PCT10       36085 non-null  object
 20  H_PCT25       36085 non-null  object
 21  H_MEDIAN      36085 non-null  object
 22  H_PCT75       36085 non-null  object
 23  H_PCT90       36085 non-null  object
 24  A_PCT10       36085 non-null  object
 25  A_PCT25       36085 non-null  object
 26  A_MEDIAN      36085 non-null  object
 27  A_PCT75       36085 non-null  object
 28  A_PCT90       36085 non-null  object
 29  ANNUAL        2605 non-null   object
 30  HOURLY        145 non-null    object
dtypes: float64(1), int64(4), object(26)
memory usage: 8.5+ MB

,AREA,AREA_TITLE,AREA_TYPE,PRIM_STATE,NAICS,NAICS_TITLE,I_GROUP,OWN_CODE,OCC_CODE,OCC_TITLE,O_GROUP,TOT_EMP,EMP_PRSE,JOBS_1000,LOC_QUOTIENT,PCT_TOTAL,H_MEAN,A_MEAN,MEAN_PRSE,H_PCT10,H_PCT25,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
0,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,00-0000,All Occupations,total,1903210,0.5,1000,1,NaN,22.52,46840,0.6,8.98,11.57,17.43,27.39,41.07,18690,24060,36250,56980,85430,NaN,NaN
1,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-0000,Management Occupations,major,87110,1.2,45.772,0.8,NaN,52.9,110040,0.7,22.95,32.37,45.73,64.58,91.89,47740,67330,95120,134320,191130,NaN,NaN
2,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1011,Chief Executives,detailed,1160,8.9,0.608,0.42,NaN,84.09,174910,3.8,23.79,47.08,77.55,#,#,49480,97930,161290,#,#,NaN,NaN
3,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1021,General and Operations Managers,detailed,31170,2,16.377,0.97,NaN,58.56,121800,1,23.09,32.57,48.64,73.58,#,48030,67740,101170,153050,#,NaN,NaN
4,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1031,Legislators,detailed,1150,6.7,0.604,1.64,NaN,*,28840,5.1,*,*,*,*,*,16220,17190,18820,27920,55970,True,NaN

In [83]:
def select_occ_codes(df, occ_codes = ['15-2051', '15-2041', '15-2051.01', 
                                      '15-2041', '15-2031', '15-1242', 
                                      '15-1243', '15-1211', '15-1221',
                                      '15-2099', '', '', '', '']):
    selected_jobs_df = df[df['OCC_CODE'].isin(occ_codes)]
    selected_jobs_df = selected_jobs_df[['AREA', 'AREA_TITLE',	'AREA_TYPE', 'PRIM_STATE',
                                         'NAICS','NAICS_TITLE','I_GROUP',	'OWN_CODE',	
                                         'OCC_CODE',	'OCC_TITLE','O_GROUP',	'TOT_EMP', 
                                         'JOBS_1000', 'H_MEAN','A_MEAN']]
    cols = ['AREA', 'AREA_TYPE', 'TOT_EMP', 'JOBS_1000', 'H_MEAN','A_MEAN']

    for col in cols:
        selected_jobs_df[col] = pd.to_numeric(selected_jobs_df[col], errors='coerce').astype('float')
    selected_jobs_df.columns = selected_jobs_df.columns.str.lower()
    return selected_jobs_df

In [84]:
data_jobs24_df = select_occ_codes(jobs24_df)
data_jobs23_df = select_occ_codes(jobs23_df)
data_jobs22_df = select_occ_codes(jobs22_df)
data_jobs21_df = select_occ_codes(jobs21_df)
data_jobs20_df = select_occ_codes(jobs20_df)

data_jobs24_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 366 entries, 68 to 37450
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   area         366 non-null    float64
 1   area_title   366 non-null    object
 2   area_type    366 non-null    float64
 3   prim_state   366 non-null    object
 4   naics        366 non-null    int64
 5   naics_title  366 non-null    object
 6   i_group      366 non-null    object
 7   own_code     366 non-null    int64
 8   occ_code     366 non-null    object
 9   occ_title    366 non-null    object
 10  o_group      366 non-null    object
 11  tot_emp      354 non-null    float64
 12  jobs_1000    354 non-null    float64
 13  h_mean       361 non-null    float64
 14  a_mean       361 non-null    float64
dtypes: float64(6), int64(2), object(7)
memory usage: 45.8+ KB

In [85]:
data_jobs24_df.occ_code.value_counts()

occ_code
15-1211    53
15-1242    52
15-2051    52
15-1243    51
15-2031    50
15-2041    48
15-1221    40
15-2099    20
Name: count, dtype: int64

In [86]:
data_jobs24_df.head()

,area,area_title,area_type,prim_state,naics,naics_title,i_group,own_code,occ_code,occ_title,o_group,tot_emp,jobs_1000,h_mean,a_mean
68,1.0,Alabama,2.0,AL,0,Cross-industry,cross-industry,1235,15-1211,Computer Systems Analysts,detailed,6830.0,3.268,54.06,112430.0
70,1.0,Alabama,2.0,AL,0,Cross-industry,cross-industry,1235,15-1221,Computer and Information Research Scientists,detailed,540.0,0.258,52.41,109020.0
74,1.0,Alabama,2.0,AL,0,Cross-industry,cross-industry,1235,15-1242,Database Administrators,detailed,1990.0,0.953,44.68,92930.0
75,1.0,Alabama,2.0,AL,0,Cross-industry,cross-industry,1235,15-1243,Database Architects,detailed,310.0,0.147,56.50,117510.0
84,1.0,Alabama,2.0,AL,0,Cross-industry,cross-industry,1235,15-2031,Operations Research Analysts,detailed,500.0,0.241,56.91,118370.0

In [87]:
def rename_cols(df, year):
    df = df[['area', 'area_title', 'occ_code', 'occ_title', 'o_group', 'tot_emp','jobs_1000',	'h_mean',	'a_mean']]
    df  = df.rename(columns={'tot_emp':f'tot_emp_{year}',
                            'jobs_1000':f'jobs_1000_{year}',
                                'h_mean':f'h_mean_{year}',
                                'a_mean':f'a_mean_{year}'})
    return df

data_jobs24_df = rename_cols(data_jobs24_df, 24)
display(data_jobs24_df)

,area,area_title,occ_code,occ_title,o_group,tot_emp_24,jobs_1000_24,h_mean_24,a_mean_24
68,1.0,Alabama,15-1211,Computer Systems Analysts,detailed,6830.0,3.268,54.06,112430.0
70,1.0,Alabama,15-1221,Computer and Information Research Scientists,detailed,540.0,0.258,52.41,109020.0
74,1.0,Alabama,15-1242,Database Administrators,detailed,1990.0,0.953,44.68,92930.0
75,1.0,Alabama,15-1243,Database Architects,detailed,310.0,0.147,56.50,117510.0
84,1.0,Alabama,15-2031,Operations Research Analysts,detailed,500.0,0.241,56.91,118370.0
...,...,...,...,...,...,...,...,...,...
36902,72.0,Puerto Rico,15-1243,Database Architects,detailed,80.0,0.088,37.58,78160.0
36911,72.0,Puerto Rico,15-2031,Operations Research Analysts,detailed,60.0,0.061,33.19,69040.0
36912,72.0,Puerto Rico,15-2041,Statisticians,detailed,380.0,0.405,23.71,49310.0
36913,72.0,Puerto Rico,15-2051,Data Scientists,detailed,120.0,0.122,34.79,72370.0
37450,78.0,Virgin Islands,15-1211,Computer Systems Analysts,detailed,50.0,1.327,31.50,65530.0

In [88]:
data_jobs20_df = rename_cols(data_jobs20_df, 20)
data_jobs21_df = rename_cols(data_jobs21_df, 21)
data_jobs22_df = rename_cols(data_jobs22_df, 22)
data_jobs23_df = rename_cols(data_jobs23_df, 23)

In [89]:
data_jobs24_df.head()

,area,area_title,occ_code,occ_title,o_group,tot_emp_24,jobs_1000_24,h_mean_24,a_mean_24
68,1.0,Alabama,15-1211,Computer Systems Analysts,detailed,6830.0,3.268,54.06,112430.0
70,1.0,Alabama,15-1221,Computer and Information Research Scientists,detailed,540.0,0.258,52.41,109020.0
74,1.0,Alabama,15-1242,Database Administrators,detailed,1990.0,0.953,44.68,92930.0
75,1.0,Alabama,15-1243,Database Architects,detailed,310.0,0.147,56.50,117510.0
84,1.0,Alabama,15-2031,Operations Research Analysts,detailed,500.0,0.241,56.91,118370.0

In [90]:
data_jobs_merged_df = (
    data_jobs20_df
    .merge(data_jobs21_df, how='outer')
    .merge(data_jobs22_df, how='outer')
    .merge(data_jobs23_df, how='outer')
    .merge(data_jobs24_df, how='outer')
)
display(data_jobs_merged_df)

,area,area_title,occ_code,occ_title,o_group,tot_emp_20,jobs_1000_20,h_mean_20,a_mean_20,tot_emp_21,jobs_1000_21,h_mean_21,a_mean_21,tot_emp_22,jobs_1000_22,h_mean_22,a_mean_22,tot_emp_23,jobs_1000_23,h_mean_23,a_mean_23,tot_emp_24,jobs_1000_24,h_mean_24,a_mean_24
0,1.0,Alabama,15-1211,Computer Systems Analysts,detailed,4900.0,2.574,44.97,93530.0,4360.0,2.261,49.56,103080.0,4880.0,2.436,52.43,109060.0,5950.0,2.897,52.18,108520.0,6830.0,3.268,54.06,112430.0
1,1.0,Alabama,15-1221,Computer and Information Research Scientists,detailed,380.0,0.201,60.84,126550.0,210.0,0.108,56.92,118390.0,NaN,NaN,48.65,101190.0,480.0,0.235,50.66,105360.0,540.0,0.258,52.41,109020.0
2,1.0,Alabama,15-1242,Database Administrators,detailed,NaN,NaN,NaN,NaN,2210.0,1.149,39.78,82730.0,1740.0,0.868,41.87,87090.0,1550.0,0.756,43.03,89510.0,1990.0,0.953,44.68,92930.0
3,1.0,Alabama,15-1243,Database Architects,detailed,NaN,NaN,NaN,NaN,360.0,0.186,59.50,123770.0,310.0,0.156,57.50,119590.0,310.0,0.149,55.00,114400.0,310.0,0.147,56.50,117510.0
4,1.0,Alabama,15-2031,Operations Research Analysts,detailed,560.0,0.292,49.09,102100.0,550.0,0.285,50.53,105110.0,510.0,0.257,52.48,109160.0,570.0,0.280,54.04,112400.0,500.0,0.241,56.91,118370.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
378,72.0,Puerto Rico,15-1243,Database Architects,detailed,NaN,NaN,NaN,NaN,40.0,0.052,35.80,74470.0,70.0,0.073,33.66,70010.0,100.0,0.104,35.38,73590.0,80.0,0.088,37.58,78160.0
379,72.0,Puerto Rico,15-2031,Operations Research Analysts,detailed,40.0,0.044,34.74,72250.0,NaN,NaN,NaN,NaN,30.0,0.037,34.91,72620.0,NaN,NaN,29.89,62160.0,60.0,0.061,33.19,69040.0
380,72.0,Puerto Rico,15-2041,Statisticians,detailed,210.0,0.259,17.92,37260.0,300.0,0.356,19.54,40640.0,250.0,0.283,20.20,42020.0,240.0,0.255,20.98,43640.0,380.0,0.405,23.71,49310.0
381,72.0,Puerto Rico,15-2051,Data Scientists,detailed,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,70.0,0.081,31.21,64910.0,90.0,0.097,34.65,72070.0,120.0,0.122,34.79,72370.0
382,78.0,Virgin Islands,15-1211,Computer Systems Analysts,detailed,NaN,NaN,27.15,56470.0,40.0,1.212,29.46,61280.0,50.0,1.406,29.98,62370.0,40.0,1.208,29.96,62320.0,50.0,1.327,31.50,65530.0

In [91]:
data_jobs_merged_df.to_csv('data_jobs_merged_df.csv', index='False')
data_jobs_merged_df.info()
data_jobs_merged_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 383 entries, 0 to 382
Data columns (total 25 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area          383 non-null    float64
 1   area_title    383 non-null    object
 2   occ_code      383 non-null    object
 3   occ_title     383 non-null    object
 4   o_group       383 non-null    object
 5   tot_emp_20    192 non-null    float64
 6   jobs_1000_20  192 non-null    float64
 7   h_mean_20     189 non-null    float64
 8   a_mean_20     189 non-null    float64
 9   tot_emp_21    351 non-null    float64
 10  jobs_1000_21  351 non-null    float64
 11  h_mean_21     353 non-null    float64
 12  a_mean_21     353 non-null    float64
 13  tot_emp_22    348 non-null    float64
 14  jobs_1000_22  348 non-null    float64
 15  h_mean_22     353 non-null    float64
 16  a_mean_22     353 non-null    float64
 17  tot_emp_23    359 non-null    float64
 18  jobs_1000_23  359 non-null    float64
 19  h_mean_23     368 non-null    float64
 20  a_mean_23     368 non-null    float64
 21  tot_emp_24    354 non-null    float64
 22  jobs_1000_24  354 non-null    float64
 23  h_mean_24     361 non-null    float64
 24  a_mean_24     361 non-null    float64
dtypes: float64(21), object(4)
memory usage: 74.9+ KB

,area,area_title,occ_code,occ_title,o_group,tot_emp_20,jobs_1000_20,h_mean_20,a_mean_20,tot_emp_21,jobs_1000_21,h_mean_21,a_mean_21,tot_emp_22,jobs_1000_22,h_mean_22,a_mean_22,tot_emp_23,jobs_1000_23,h_mean_23,a_mean_23,tot_emp_24,jobs_1000_24,h_mean_24,a_mean_24
0,1.0,Alabama,15-1211,Computer Systems Analysts,detailed,4900.0,2.574,44.97,93530.0,4360.0,2.261,49.56,103080.0,4880.0,2.436,52.43,109060.0,5950.0,2.897,52.18,108520.0,6830.0,3.268,54.06,112430.0
1,1.0,Alabama,15-1221,Computer and Information Research Scientists,detailed,380.0,0.201,60.84,126550.0,210.0,0.108,56.92,118390.0,NaN,NaN,48.65,101190.0,480.0,0.235,50.66,105360.0,540.0,0.258,52.41,109020.0
2,1.0,Alabama,15-1242,Database Administrators,detailed,NaN,NaN,NaN,NaN,2210.0,1.149,39.78,82730.0,1740.0,0.868,41.87,87090.0,1550.0,0.756,43.03,89510.0,1990.0,0.953,44.68,92930.0
3,1.0,Alabama,15-1243,Database Architects,detailed,NaN,NaN,NaN,NaN,360.0,0.186,59.50,123770.0,310.0,0.156,57.50,119590.0,310.0,0.149,55.00,114400.0,310.0,0.147,56.50,117510.0
4,1.0,Alabama,15-2031,Operations Research Analysts,detailed,560.0,0.292,49.09,102100.0,550.0,0.285,50.53,105110.0,510.0,0.257,52.48,109160.0,570.0,0.280,54.04,112400.0,500.0,0.241,56.91,118370.0

In [92]:
data_jobs_merged_df.isna().sum()

area              0
area_title        0
occ_code          0
occ_title         0
o_group           0
tot_emp_20      191
jobs_1000_20    191
h_mean_20       194
a_mean_20       194
tot_emp_21       32
jobs_1000_21     32
h_mean_21        30
a_mean_21        30
tot_emp_22       35
jobs_1000_22     35
h_mean_22        30
a_mean_22        30
tot_emp_23       24
jobs_1000_23     24
h_mean_23        15
a_mean_23        15
tot_emp_24       29
jobs_1000_24     29
h_mean_24        22
a_mean_24        22
dtype: int64

In [94]:
data_jobs_merged_df.groupby('area_title')['occ_title'].count()

area_title
Alabama                 8
Alaska                  7
Arizona                 8
Arkansas                7
California              8
Colorado                7
Connecticut             8
Delaware                6
District of Columbia    8
Florida                 8
Georgia                 8
Guam                    2
Hawaii                  7
Idaho                   7
Illinois                8
Indiana                 8
Iowa                    8
Kansas                  7
Kentucky                8
Louisiana               7
Maine                   6
Maryland                8
Massachusetts           8
Michigan                8
Minnesota               7
Mississippi             8
Missouri                7
Montana                 6
Nebraska                7
Nevada                  7
New Hampshire           7
New Jersey              8
New Mexico              7
New York                8
North Carolina          8
North Dakota            6
Ohio                    8
Oklahoma                8
Oregon                  7
Pennsylvania            8
Puerto Rico             6
Rhode Island            7
South Carolina          8
South Dakota            4
Tennessee               8
Texas                   8
Utah                    8
Vermont                 6
Virgin Islands          1
Virginia                8
Washington              8
West Virginia           7
Wisconsin               7
Wyoming                 5
Name: occ_title, dtype: int64